RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sd_host.c
/* EMMC EXTCSD register bitfields. */
#define CY_SD_HOST_EXTCSD_SEC_COUNT         (53U)
#define CY_SD_HOST_EXTCSD_GENERIC_CMD6_TIME (62U)
#define CY_SD_HOST_EXTCSD_GENERIC_CMD6_TIME_MSK (0xFFUL)
#define CY_SD_HOST_EXTCSD_SIZE              (128U)

/* CSD register masks/positions. */
#define CY_SD_HOST_CSD_V1_C_SIZE_MSB_MASK   (0x00000003UL)
#define CY_SD_HOST_CSD_V1_C_SIZE_ISB_MASK   (0xFF000000UL)
#define CY_SD_HOST_CSD_V1_C_SIZE_LSB_MASK   (0x00C00000UL)
#define CY_SD_HOST_CSD_V1_C_SIZE_MSB_POS    (0U)
#define CY_SD_HOST_CSD_V1_C_SIZE_ISB_POS    (24U)
#define CY_SD_HOST_CSD_V1_C_SIZE_LSB_POS    (22U)
#define CY_SD_HOST_CSD_V1_C_SIZE_MSB_MULT   (10U)
#define CY_SD_HOST_CSD_V1_C_SIZE_ISB_MULT   (2U)
#define CY_SD_HOST_CSD_V1_C_SIZE_MULT_MASK  (0x00000380UL)
#define CY_SD_HOST_CSD_V1_C_SIZE_MULT_POS   (7U)
#define CY_SD_HOST_CSD_V1_READ_BL_LEN_MASK  (0x00000F00UL)
#define CY_SD_HOST_CSD_V1_READ_BL_LEN_POS   (8U)
#define CY_SD_HOST_CSD_V1_BL_LEN_512        (9UL)
#define CY_SD_HOST_CSD_V1_BL_LEN_1024       (10UL)
#define CY_SD_HOST_CSD_V1_BL_LEN_2048       (11UL)
#define CY_SD_HOST_CSD_V1_1024_SECT_FACTOR  (2UL)
#define CY_SD_HOST_CSD_V1_2048_SECT_FACTOR  (4UL)
#define CY_SD_HOST_CSD_V2_C_SIZE_POS        (8U)
#define CY_SD_HOST_CSD_V2_SECTOR_MULT       (10U)
#define CY_SD_HOST_CSD_TEMP_WRITE_PROTECT   (20U)
#define CY_SD_HOST_CSD_PERM_WRITE_PROTECT   (21U)
#define CY_SD_HOST_CSD_LSB_MASK             (0x000000FFUL)
#define CY_SD_HOST_CSD_ISBR_MASK            (0x0000FF00UL)
#define CY_SD_HOST_CSD_ISBL_MASK            (0x00FF0000UL)
#define CY_SD_HOST_CSD_MSB_MASK             (0xFF000000UL)
#define CY_SD_HOST_CSD_ISB_SHIFT            (16U)

/* CMD6 EXT_CSD access mode. */
#define CY_SD_HOST_EMMC_ACCESS_COMMAND_SET  (0x0U)
#define CY_SD_HOST_EMMC_ACCESS_SET_BITS     (0x1U)
#define CY_SD_HOST_EMMC_ACCESS_CLEAR_BITS   (0x2U)
#define CY_SD_HOST_EMMC_ACCESS_WRITE_BYTE   (0x3UL)

/* CCCR register values. */
#define CY_SD_HOST_CCCR_SPEED_CONTROL       (0x00013UL)
#define CY_SD_HOST_CCCR_IO_ABORT            (0x00006UL)
#define CY_SD_HOST_CCCR_SPEED_SHS_MASK      (0x1UL)
#define CY_SD_HOST_CCCR_SPEED_EHS_MASK      (0x2UL)
#define CY_SD_HOST_CCCR_SPEED_BSS0_MASK     (0x2UL)
#define CY_SD_HOST_CCCR_SPEED_BSS1_MASK     (0x4UL)
#define CY_SD_HOST_CCCR_SPEED_BSS2_MASK     (0x8UL)
#define CY_SD_HOST_CCCR_BUS_INTERFACE_CTR   (0x00007UL)
#define CY_SD_HOST_CCCR_BUS_WIDTH_0         (0x1UL)
#define CY_SD_HOST_CCCR_BUS_WIDTH_1         (0x2UL)
#define CY_SD_HOST_CCCR_S8B                 (0x4UL)

/* SDMA constants. */
#define CY_SD_HOST_SDMA_BUF_BYTES_4K        (0x0U) /* 4K bytes SDMA Buffer Boundary. */
#define CY_SD_HOST_SDMA_BUF_BYTES_8K        (0x1U) /* 8K bytes SDMA Buffer Boundary. */
#define CY_SD_HOST_SDMA_BUF_BYTES_16K       (0x2U) /* 16K bytes SDMA Buffer Boundary. */
#define CY_SD_HOST_SDMA_BUF_BYTES_32K       (0x3U) /* 32K bytes SDMA Buffer Boundary. */
#define CY_SD_HOST_SDMA_BUF_BYTES_64K       (0x4U) /* 64K bytes SDMA Buffer Boundary. */
#define CY_SD_HOST_SDMA_BUF_BYTES_128K      (0x5U) /* 128K bytes SDMA Buffer Boundary. */
#define CY_SD_HOST_SDMA_BUF_BYTES_256K      (0x6U) /* 256K bytes SDMA Buffer Boundary. */
#define CY_SD_HOST_SDMA_BUF_BYTES_512K      (0x7U) /* 512K bytes SDMA Buffer Boundary. */

/* CMD38 arguments. */
#define CY_SD_HOST_ERASE                    (0x00000000UL)  /* The SD/eMMC Erase. */
#define CY_SD_HOST_SD_DISCARD               (0x00000001UL)  /* The SD Discard. */
#define CY_SD_HOST_SD_FULE                  (0x00000002UL)  /* The SD FULE. */
#define CY_SD_HOST_EMMC_DISCARD             (0x00000003UL)  /* The eMMC Discard. */
#define CY_SD_HOST_EMMC_SECURE_ERASE        (0x80000000UL)  /* The eMMC Secure Erase. */
#define CY_SD_HOST_EMMC_SECURE_TRIM_STEP_2  (0x80008000UL)  /* The eMMC Secure Trim Step 2. */
#define CY_SD_HOST_EMMC_SECURE_TRIM_STEP_1  (0x80000001UL)  /* The eMMC Secure Trim Step 1. */
#define CY_SD_HOST_EMMC_TRIM                (0x00000001UL)  /* The eMMC Trim. */

/* CMD52 constants. */
#define CY_SD_HOST_CMD52_RWFLAG_POS         (31U)          /* The CMD52 RW Flag position. */
#define CY_SD_HOST_CMD52_FUNCT_NUM_POS      (28U)          /* The CMD52 Function Number position. */
#define CY_SD_HOST_CMD52_FUNCT_NUM_MSK      (0x07UL)       /* The CMD52 Function Number mask. */
#define CY_SD_HOST_CMD52_RAWFLAG_POS        (27U)          /* The CMD52 Raw Flag position. */
#define CY_SD_HOST_CMD52_REG_ADDR_POS       (9U)           /* The CMD52 Register Address position. */
#define CY_SD_HOST_CMD52_REG_ADDR_MSK       (0x1FFFFUL)    /* The CMD52 Register Address mask. */
#define CY_SD_HOST_CMD52_DATA_MSK           (0xFFUL)       /* The CMD52 data mask. */

/* Interrupt masks. */
#define CY_SD_HOST_NORMAL_INT_MSK           (0x1FFFU)  /* The enabled Normal Interrupts. */
#define CY_SD_HOST_ERROR_INT_MSK            (0x07FFU)  /* The enabled Error Interrupts. */

/* SD output clock. */
#define CY_SD_HOST_CLK_400K                 (400UL * 1000UL)    /* 400 kHz. */
#define CY_SD_HOST_CLK_10M                  (10UL * 1000UL * 1000UL) /* 10 MHz. */
#define CY_SD_HOST_CLK_20M                  (20UL * 1000UL * 1000UL) /* 20 MHz. */

/** \endcond */

/** \cond PARAM_CHECK_MACROS */

#define CY_SD_HOST_FREQ_MAX                 (50000000UL)  /* The maximum clk frequency. */
#define CY_SD_HOST_IS_FREQ_VALID(frequency) ((0UL < (frequency)) && (CY_SD_HOST_FREQ_MAX >= (frequency)))

#define CY_SD_HOST_IS_SD_BUS_WIDTH_VALID(width)         ((CY_SD_HOST_BUS_WIDTH_1_BIT == (width)) || \
                                                         (CY_SD_HOST_BUS_WIDTH_4_BIT == (width)))

#define CY_SD_HOST_IS_EMMC_BUS_WIDTH_VALID(width)       ((CY_SD_HOST_BUS_WIDTH_1_BIT == (width)) || \
                                                         (CY_SD_HOST_BUS_WIDTH_4_BIT == (width)) || \
                                                         (CY_SD_HOST_BUS_WIDTH_8_BIT == (width)))

#define CY_SD_HOST_IS_BUS_WIDTH_VALID(width, cardType)  ((CY_SD_HOST_EMMC == (cardType)) ? \
                                                         CY_SD_HOST_IS_EMMC_BUS_WIDTH_VALID(width) : \
                                                         CY_SD_HOST_IS_SD_BUS_WIDTH_VALID(width))

