RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sd_host.c
#define CY_SD_HOST_IS_AUTO_CMD_VALID(cmd)               ((CY_SD_HOST_AUTO_CMD_NONE == (cmd)) || \
                                                         (CY_SD_HOST_AUTO_CMD_12 == (cmd)) || \
                                                         (CY_SD_HOST_AUTO_CMD_23 == (cmd)) || \
                                                         (CY_SD_HOST_AUTO_CMD_AUTO == (cmd)))

#define CY_SD_HOST_IS_TIMEOUT_VALID(timeout)            (CY_SD_HOST_MAX_TIMEOUT >= (timeout))

#define CY_SD_HOST_BLK_SIZE_MAX                         (2048UL)  /* The maximum block size. */
/* Macro to check that block size is less than 2048 bytes and block size is even if DDR50 mode is selected */
#define CY_SD_HOST_IS_BLK_SIZE_VALID(size, speedMode)   ((CY_SD_HOST_BLK_SIZE_MAX >= (size)) ? \
                                                         (((speedMode) == 0x4UL) ? (((size) % 2UL) == 0UL) : true) : false)

#define CY_SD_HOST_IS_ERASE_VALID(eraseType)            ((CY_SD_HOST_ERASE_ERASE == (eraseType)) || \
                                                         (CY_SD_HOST_ERASE_DISCARD == (eraseType)) || \
                                                         (CY_SD_HOST_ERASE_FULE == (eraseType)) || \
                                                         (CY_SD_HOST_ERASE_SECURE == (eraseType)) || \
                                                         (CY_SD_HOST_ERASE_SECURE_TRIM_STEP_2 == (eraseType)) || \
                                                         (CY_SD_HOST_ERASE_SECURE_TRIM_STEP_1 == (eraseType)) || \
                                                         (CY_SD_HOST_ERASE_TRIM == (eraseType)))

#define CY_SD_HOST_IS_CMD_IDX_VALID(cmd)                (0UL == ((cmd) & (uint32_t)~(CY_SD_HOST_ACMD_OFFSET_MASK | \
                                                                                     CY_SD_HOST_MMC_CMD_TAG | \
                                                                                     CY_SD_HOST_SD_ACMD_OFFSET)))

#define CY_SD_HOST_IS_DMA_VALID(dmaType)                ((CY_SD_HOST_DMA_SDMA == (dmaType)) || \
                                                         (CY_SD_HOST_DMA_ADMA2 == (dmaType)) || \
                                                         (CY_SD_HOST_DMA_ADMA2_ADMA3 == (dmaType)))

#define CY_SD_HOST_IS_SPEED_MODE_VALID(speedMode)       ((CY_SD_HOST_BUS_SPEED_DEFAULT == (speedMode)) || \
                                                         (CY_SD_HOST_BUS_SPEED_HIGHSPEED == (speedMode)) || \
                                                         (CY_SD_HOST_BUS_SPEED_SDR12_5 == (speedMode)) || \
                                                         (CY_SD_HOST_BUS_SPEED_SDR25 == (speedMode)) || \
                                                         (CY_SD_HOST_BUS_SPEED_SDR50 == (speedMode)) || \
                                                         (CY_SD_HOST_BUS_SPEED_DDR50 == (speedMode)) || \
                                                         (CY_SD_HOST_BUS_SPEED_EMMC_LEGACY == (speedMode)) || \
                                                         (CY_SD_HOST_BUS_SPEED_EMMC_HIGHSPEED_SDR == (speedMode)))

#define CY_SD_HOST_IS_DMA_WR_RD_VALID(dmaType)          ((CY_SD_HOST_DMA_SDMA == (dmaType)) || \
                                                         (CY_SD_HOST_DMA_ADMA2 == (dmaType)))

#define CY_SD_HOST_IS_CMD_TYPE_VALID(cmdType)            ((CY_SD_HOST_CMD_NORMAL == (cmdType)) || \
                                                         (CY_SD_HOST_CMD_SUSPEND == (cmdType)) || \
                                                         (CY_SD_HOST_CMD_RESUME == (cmdType)) || \
                                                         (CY_SD_HOST_CMD_ABORT == (cmdType)))

#define CY_SD_HOST_IS_RELIABLE_WRITE(cardType, rw)      ((CY_SD_HOST_EMMC != (cardType)) && \
                                                          (false == (rw)))

/** \endcond */

__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_eMMC_InitCard(SDHC_Type *base,
                                             cy_stc_sd_host_sd_card_config_t const *config,
                                             cy_stc_sd_host_context_t *context);
static cy_en_sd_host_status_t Cy_SD_Host_CmdRxData(SDHC_Type *base, cy_stc_sd_host_data_config_t *pcmd);
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_CmdTxData(SDHC_Type *base, cy_stc_sd_host_data_config_t *pcmd);
static cy_en_sd_host_status_t Cy_SD_Host_OpsGoIdle(SDHC_Type *base);
static cy_en_sd_host_status_t Cy_SD_Host_OpsVoltageSwitch(SDHC_Type *base,
                                                          cy_stc_sd_host_context_t const *context);
static cy_en_sd_host_status_t Cy_SD_Host_OpsSwitchFunc(SDHC_Type *base,
                                                       uint32_t cmdArgument);
static cy_en_sd_host_status_t Cy_SD_Host_SdCardSwitchFunc(SDHC_Type *base, uint32_t cmdArgument,
                                                                     cy_en_sd_host_card_type_t cardType);
static cy_en_sd_host_bus_speed_mode_t Cy_SD_Host_FindBusSpeedMode(SDHC_Type *base, bool lowVoltageSignaling,
                                                            cy_en_sd_host_card_type_t cardType);
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_OpsSetBlockCount(SDHC_Type *base,
                                                                   bool reliableWrite,
                                                                   uint32_t blockNum);
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_OpsProgramCsd(SDHC_Type *base,
                                                                uint32_t csd,
                                                                cy_stc_sd_host_context_t *context);
static cy_en_sd_host_status_t Cy_SD_Host_OpsSelectCard(SDHC_Type *base,
                                                      cy_stc_sd_host_context_t const *context);
static cy_en_sd_host_status_t Cy_SD_Host_OpsSendIoRwDirectCmd(SDHC_Type *base,
                                                            uint32_t rwFlag,
                                                            uint32_t functionNumber,
                                                            uint32_t rawFlag,
                                                            uint32_t registerAddress,
                                                            uint32_t data);
static cy_en_sd_host_status_t Cy_SD_Host_OpsSendAppCmd(SDHC_Type *base,
                                                       cy_stc_sd_host_context_t const *context);
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_OpsSendIfCond(SDHC_Type *base,
                                                       uint32_t cmdArgument,
                                                       bool noResponse);
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_OpsSetSdBusWidth(SDHC_Type *base,
                                                        uint32_t cmdArgument,
                                                        cy_stc_sd_host_context_t const *context);
static cy_en_sd_host_status_t Cy_SD_Host_OpsSdioSendOpCond(SDHC_Type *base,
                                                           uint32_t *ocrReg,
                                                           uint32_t cmdArgument);
static cy_en_sd_host_status_t Cy_SD_Host_OpsSdSendOpCond(SDHC_Type *base,
                                                        uint32_t *ocrReg,
                                                        uint32_t cmdArgument,
                                                        cy_stc_sd_host_context_t const *context);
static cy_en_sd_host_status_t Cy_SD_Host_MmcOpsSendOpCond(SDHC_Type *base,
                                                        uint32_t *ocrReg,
                                                        uint32_t cmdArgument);
static cy_en_sd_host_status_t Cy_SD_Host_SdCardChangeClock(SDHC_Type *base, uint32_t frequency);
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_PollBufferReadReady(SDHC_Type *base);
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_PollBufferWriteReady(SDHC_Type *base);
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_PollCmdComplete(SDHC_Type *base);
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_PollTransferComplete(SDHC_Type *base);
static void Cy_SD_Host_ErrorReset(SDHC_Type *base);
static void Cy_SD_Host_NormalReset(SDHC_Type *base);
__STATIC_INLINE bool Cy_SD_Host_VoltageCheck(SDHC_Type *base);
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_IoOcr(SDHC_Type *base,
                                      bool lowVoltageSignaling,
                                      uint32_t *s18aFlag,
                                      uint32_t *sdioFlag,
                                      bool *mpFlag,
                                      uint32_t *ocrReg);
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_SdOcr(SDHC_Type *base,
                                      bool lowVoltageSignaling,
                                      uint32_t *s18aFlag,
                                      bool *mpFlag,
                                      bool f8Flag,
                                      uint32_t *ocrReg,
                                      cy_stc_sd_host_context_t *context);
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_PollCmdLineFree(SDHC_Type const *base);
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_PollDataLineNotInhibit(SDHC_Type const *base);
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_PollDataLineFree(SDHC_Type const *base);

/* High-level section */

