RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sd_host.c
/*******************************************************************************
* Function Name: Cy_SD_Host_InitCard
****************************************************************************//**
*
*  Initializes a card if it is connected.
*  After this function is called, the card is in the transfer state.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param *config
*     The pointer to the SD card configuration structure.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
* \note When lowVoltageSignaling is True, this function negotiates with
* the card to change the bus signaling level to 1.8V.
* The dedicated io_volt_sel pin is used to change the regulator supplying voltage
* to the VDDIO of the SD block in order to operate at 1.8V. To configure
* the custom IO pin in order to control (using the GPIO driver) the regulator
* supplying voltage, the user must implement weak Cy_SD_Host_ChangeIoVoltage().
* Also, this function must set the SIGNALING_EN bit of the SDHC_CORE_HOST_CTRL2_R
* register when ioVoltage = CY_SD_HOST_IO_VOLT_1_8V.
*
* \note After calling this function, the SD Host is configured in
* highest supported bus speed mode (for the SD card, irrespective of
* the value of lowVoltageSignaling), or eMMC legacy (for the eMMC card)
* with SD clock = 25 MHz. The Power Limit and Driver Strength functions of
* the CMD6 command are set into the default state (0.72 W and Type B).
* It is the user's responsibility to set Power Limit and Driver Strength
* depending on the capacitance load of the host system.
* To change Speed mode, the user must call the Cy_SD_Host_SetBusSpeedMode()
* and Cy_SD_Host_SdCardChangeClock() functions.
* Additionally, SD SDR25, SD SDR50, eMMC High Speed SDR modes require
* settings CLOCK_OUT_DLY and CLOCK_IN_DLY bit-fields of the GP_OUT_R register.
* For more information about Speed modes, refer to Part 1 Physical Layer
* SD Specification.
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_InitCard(SDHC_Type *base,
                                           cy_stc_sd_host_sd_card_config_t *config,
                                           cy_stc_sd_host_context_t *context)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    cy_en_sd_host_bus_speed_mode_t speedMode = CY_SD_HOST_BUS_SPEED_DEFAULT;
    uint32_t ocrReg; /* The Operation Condition register. */
    uint32_t cidReg[CY_SD_HOST_CID_SIZE]; /* The Device Identification register. */
    uint32_t csdReg[CY_SD_HOST_CSD_SIZE]; /* The Card-Specific Data register. */
    uint32_t sdioFlag = 0UL; /* The IO flag. */
    uint32_t s18aFlag = 0UL; /* The S18A flag. */
    bool f8Flag = false; /* The CMD8 flag. */
    bool mpFlag = false; /* The MEM flag. */

    if ((NULL != base) && (NULL != context) && (NULL != config))
    {
        CY_ASSERT_L3(CY_SD_HOST_IS_BUS_WIDTH_VALID(config->busWidth, context->cardType));

        /* Wait until the card is stable and check if it is connected. */
        if ((true == Cy_SD_Host_IsCardConnected(base)) ||
            (CY_SD_HOST_EMMC == context->cardType))
        {
            Cy_SD_Host_EnableCardVoltage(base);

            Cy_SD_Host_ChangeIoVoltage(base, CY_SD_HOST_IO_VOLT_3_3V);

            /* Set the host bus width to 1 bit. */
            (void)Cy_SD_Host_SetHostBusWidth(base, CY_SD_HOST_BUS_WIDTH_1_BIT);

            /* Change the host SD clock to 400 kHz. */
            (void)Cy_SD_Host_SdCardChangeClock(base, CY_SD_HOST_CLK_400K);

            /* Wait until the voltage and clock are stable. */
            Cy_SysLib_Delay(CY_SD_HOST_BUS_RAMP_UP_TIME_MS);

            context->RCA = 0UL;

            if (CY_SD_HOST_EMMC != context->cardType)
            {
                /* Send CMD0 and CMD8 commands. */
                f8Flag = Cy_SD_Host_VoltageCheck(base);

                /* Set SDHC can be supported. */
                if (f8Flag)
                {
                    context->cardCapacity = CY_SD_HOST_SDHC;
                }

                /* Clear the insert event */
                Cy_SD_Host_NormalReset(base);
                Cy_SysLib_Delay(1);

                /* Send CMD5 to get IO OCR */
                ret = Cy_SD_Host_IoOcr(base,
                                       config->lowVoltageSignaling,
                                       &s18aFlag,
                                       &sdioFlag,
                                       &mpFlag,
                                       &ocrReg);

                /* Check if CMD5 has no response or MP = 1.
                *  This means we have a SD memory card or Combo card.
                */
                if (mpFlag || (0UL == sdioFlag))
                {
                    /* Send ACMD41 */
                    ret = Cy_SD_Host_SdOcr(base,
                                           config->lowVoltageSignaling,
                                           &s18aFlag,
                                           &mpFlag,
                                           f8Flag,
                                           &ocrReg,
                                           context);
                }

                /* Set the card type */
                if (CY_SD_HOST_ERROR_UNUSABLE_CARD != ret) /* The Ready state. */
                {
                    if (true == mpFlag)
                    {
                        if (0UL != sdioFlag)
                        {
                            context->cardType = CY_SD_HOST_COMBO;
                        }
                        else
                        {
                            context->cardType = CY_SD_HOST_SD;
                        }
                    }
                    else if (0UL != sdioFlag)
                    {
                        context->cardType = CY_SD_HOST_SDIO;
                    }
                    else
                    {
                        /* The unusable card */
                        ret = CY_SD_HOST_ERROR_UNUSABLE_CARD;

