RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sd_host.c
                        context->cardType = CY_SD_HOST_UNUSABLE;
                    }

                    if (CY_SD_HOST_ERROR_UNUSABLE_CARD != ret)
                    {
                        if ((1UL == s18aFlag) && (config->lowVoltageSignaling))
                        {
                            /* Voltage switch (CMD11). */
                            ret =  Cy_SD_Host_OpsVoltageSwitch(base, context);

                            if (CY_SD_HOST_SUCCESS != ret)  /* Initialize again at 3.3 V. */
                            {
                                Cy_SD_Host_ChangeIoVoltage(base, CY_SD_HOST_IO_VOLT_3_3V);

                                /* Wait until the voltage and clock are stable. */
                                Cy_SysLib_Delay(CY_SD_HOST_BUS_RAMP_UP_TIME_MS);

                                /* Send CMD0 and CMD8 commands. */
                                f8Flag = Cy_SD_Host_VoltageCheck(base);

                                if (0UL < sdioFlag)
                                {
                                    /* Send CMD5 to get IO OCR. */
                                    ret = Cy_SD_Host_IoOcr(base,
                                                           config->lowVoltageSignaling,
                                                           &s18aFlag,
                                                           &sdioFlag,
                                                           &mpFlag,
                                                           &ocrReg);
                                }

                                if (mpFlag)
                                {
                                    /* Send ACMD41 */
                                    ret = Cy_SD_Host_SdOcr(base,
                                                           config->lowVoltageSignaling,
                                                           &s18aFlag,
                                                           &mpFlag,
                                                           f8Flag,
                                                           &ocrReg,
                                                           context);
                                }

                                s18aFlag = 0UL;
                            }
                        }

                        if (CY_SD_HOST_SDIO != context->cardType)
                        {
                            /* Get CID (CMD2).  */
                            ret = Cy_SD_Host_GetCid(base, cidReg);

                            Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);
                        }                                       /* The Identification state. */

                        /* Get RCA (CMD3). */
                        context->RCA = Cy_SD_Host_GetRca(base);

                        Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);

                        if (CY_SD_HOST_SDIO != context->cardType) /* The stand-by state. */
                        {
                            /* Get CSD (CMD9) to save
                             * Max Sector Number in the context.
                             */
                            ret = Cy_SD_Host_GetCsd(base, csdReg, context);

                            if (CY_SD_HOST_MIN_SDXC_SECTORS <= context->maxSectorNum)
                            {
                               context->cardCapacity = CY_SD_HOST_SDXC;
                            }

                            Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);
                        }

                        if (CY_SD_HOST_SUCCESS == ret) /* The Standby state. */
                        {
                            /* Select the card (CMD7). */
                            ret = Cy_SD_Host_OpsSelectCard(base, context);
                        }

                        if ((CY_SD_HOST_SUCCESS == ret) &&
                            (CY_SD_HOST_SDIO != context->cardType)) /* The Transition state. */
                        {
                            /* Set Bus Width (ACMD6). */
                            if (CY_SD_HOST_BUS_WIDTH_1_BIT != config->busWidth)
                            {
                                ret = Cy_SD_Host_SetBusWidth(base,
                                                             CY_SD_HOST_BUS_WIDTH_4_BIT,
                                                             context);
                                Cy_SysLib_Delay(CY_SD_HOST_READ_TIMEOUT_MS);
                            }

                            if (CY_SD_HOST_SUCCESS == ret)
                            {
                                /* Find Highest Supported Bus Speed Mode (CMD6). */
                                speedMode = Cy_SD_Host_FindBusSpeedMode(base, ((bool)s18aFlag && config->lowVoltageSignaling), context->cardType);
                                Cy_SysLib_Delay(CY_SD_HOST_READ_TIMEOUT_MS);


                                /* Set Bus Speed Mode (CMD6). */
                                ret = Cy_SD_Host_SetBusSpeedMode(base,
                                                                 speedMode,
                                                                 context);
                                Cy_SysLib_Delay(CY_SD_HOST_READ_TIMEOUT_MS);

                                if (CY_SD_HOST_SUCCESS == ret)
                                {
                                    (void)Cy_SD_Host_SdCardChangeClock(base,
                                                                       CY_SD_HOST_CLK_25M);
                                }
                                Cy_SysLib_Delay(CY_SD_HOST_CLK_RAMP_UP_TIME_MS);
                            }
                        }
                    }
                }
            }
            else
            {
                ret = Cy_SD_Host_eMMC_InitCard(base, config, context);
            }

            *config->rca = context->RCA;
            *config->cardType = context->cardType;
            *config->cardCapacity = context->cardCapacity;
        }
        else
        {
            /* The SD card is disconnected or an embedded card. */
            ret = CY_SD_HOST_ERROR_DISCONNECTED;
        }
    }

    return ret;
}


