RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sd_host.c
    /* Send the application command (CMD55) */
    ret = Cy_SD_Host_OpsSendAppCmd(base, context);

    if (CY_SD_HOST_SUCCESS == ret)
    {
        ret = Cy_SD_Host_SendCommand(base, &cmd);

        if (CY_SD_HOST_SUCCESS == ret)
        {
            /* Wait for the Command Complete event. */
            ret = Cy_SD_Host_PollCmdComplete(base);
        }

        Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);

        (void)Cy_SD_Host_GetResponse(base, (uint32_t *)&response, false);

        *ocrReg = response;

        if (0x0UL == cmdArgument)
        {
            /* Voltage window = 0 */
        }
        else if (0UL == (response & CY_SD_HOST_ARG_ACMD41_BUSY))
        {
            /* Set an error */
            ret = CY_SD_HOST_OPERATION_INPROGRESS;
        }
        else
        {
            /* Success */
        }
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_MmcOpsSendOpCond
****************************************************************************//**
*
*  Send CMD1 (Send MMC operation condition command).
*
* \param *base
*     The SD host registers structure pointer.
*
* \param *ocrReg
*     The Operation Condition register (OCR).
*
* \param cmdArgument
*     The command argument.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
static cy_en_sd_host_status_t Cy_SD_Host_MmcOpsSendOpCond(SDHC_Type *base,
                                                   uint32_t *ocrReg,
                                                   uint32_t cmdArgument)
{
    cy_stc_sd_host_cmd_config_t cmd;
    cy_en_sd_host_status_t      ret;
    uint32_t                    response = 0UL;

    cmd.commandIndex    = CY_SD_HOST_SD_CMD1;
    cmd.commandArgument = cmdArgument;
    cmd.dataPresent     = false;
    cmd.enableAutoResponseErrorCheck = false;
    cmd.respType        = CY_SD_HOST_RESPONSE_LEN_48; /* R3 response */
    cmd.enableCrcCheck  = false;
    cmd.enableIdxCheck  = false;
    cmd.cmdType         = CY_SD_HOST_CMD_NORMAL;

    ret = Cy_SD_Host_SendCommand(base, &cmd);

    if (CY_SD_HOST_SUCCESS == ret)
    {
        /* Wait for the Command Complete event. */
        ret = Cy_SD_Host_PollCmdComplete(base);
    }

    Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);

    /* Get the OCR register */
    (void)Cy_SD_Host_GetResponse(base, (uint32_t *)&response, false);

    *ocrReg = response;

    if (CY_SD_HOST_OCR_BUSY_BIT != (CY_SD_HOST_OCR_BUSY_BIT & response))
    {
        ret = CY_SD_HOST_OPERATION_INPROGRESS;
    }

    return ret;
}

/* The SD driver low-level section */

/*******************************************************************************
* Function Name: Cy_SD_Host_SdCardChangeClock
****************************************************************************//**
*
*  Changes the Host controller SD clock.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param frequency
*     The frequency in Hz.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
static cy_en_sd_host_status_t Cy_SD_Host_SdCardChangeClock(SDHC_Type *base, uint32_t frequency)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    uint32_t               clkDiv;
    uint32_t               clockInput = CY_SD_HOST_PERI_FREQUENCY;

    CY_ASSERT_L2(CY_SD_HOST_IS_FREQ_VALID(frequency));

    if (NULL != base)
    {
        clkDiv = (clockInput / frequency) >> 1UL;
        Cy_SD_Host_DisableSdClk(base);
        ret = Cy_SD_Host_SetSdClkDiv(base, (uint16_t)clkDiv);
        Cy_SD_Host_EnableSdClk(base);
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_Init
****************************************************************************//**
*
*  Initializes the SD host module.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param config
*     The SD host module configuration.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_Init(SDHC_Type *base,
                      const cy_stc_sd_host_init_config_t *config,
                      cy_stc_sd_host_context_t *context)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_SUCCESS;

    /* Check for the NULL pointer. */
    if ((NULL != base) && (NULL != config) && (NULL != context))
    {
        CY_ASSERT_L3(CY_SD_HOST_IS_DMA_VALID(config->dmaType));

        SDHC_CORE_GP_OUT_R(base) = _VAL2FLD(SDHC_CORE_GP_OUT_R_IO_VOLT_SEL_OE, 1u) | /* The IO voltage selection signal. */
                              _VAL2FLD(SDHC_CORE_GP_OUT_R_CARD_MECH_WRITE_PROT_EN, 1u) | /* The mechanical write protection. */
                              _VAL2FLD(SDHC_CORE_GP_OUT_R_LED_CTRL_OE, config->enableLedControl ? 1u : 0u) | /* The LED Control. */
                              _VAL2FLD(SDHC_CORE_GP_OUT_R_CARD_CLOCK_OE, 1u) | /* The Sd Clk. */
                              _VAL2FLD(SDHC_CORE_GP_OUT_R_CARD_IF_PWR_EN_OE, 1u) | /* Enable the card_if_pwr_en. */
                              _VAL2FLD(SDHC_CORE_GP_OUT_R_CARD_DETECT_EN, 1u); /* Enable the card detection. */

        SDHC_CORE_XFER_MODE_R(base) = 0U;

        context->dmaType = config->dmaType;

        if (config->emmc)
        {
            /* Save the card type. */
            context->cardType = CY_SD_HOST_EMMC;

            /* Set the eMMC Card present. */
            SDHC_CORE_EMMC_CTRL_R(base) = (uint16_t)_CLR_SET_FLD16U(SDHC_CORE_EMMC_CTRL_R(base),
                                          SDHC_CORE_EMMC_CTRL_R_CARD_IS_EMMC,
                                          1U);

