RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sd_host.c
                    /* Check if the card is in the transition state. */
                    if ((CY_SD_HOST_CARD_TRAN << CY_SD_HOST_CMD13_CURRENT_STATE) != 
                        (response & CY_SD_HOST_CMD13_CURRENT_STATE_MSK))
                    {
                       ret = CY_SD_HOST_ERROR;
                    }
                }
            }
        }
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_WriteProtect
****************************************************************************//**
*
*  Write protects the blocks of data from the SD card.
*  This function should only be called after Cy_SD_Host_SDCard_Init()/eMMC_Init().
*
* \param *base
*     The SD host registers structure pointer.
*
* \param writeProtect
*     \ref cy_en_sd_host_write_protect_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_WriteProtect(SDHC_Type *base,
                                               cy_en_sd_host_write_protect_t writeProtect,
                                               cy_stc_sd_host_context_t *context)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_SUCCESS;
    uint32_t               csdReg;

    /* Check for the NULL pointer. */
    if ((NULL != base) && (NULL != context))
    {
        switch (writeProtect)
        {
            case CY_SD_HOST_PERMANENT:
                csdReg = 1UL << CY_SD_HOST_CSD_PERM_WRITE_PROTECT;
                break;
            case CY_SD_HOST_ENABLE_TEMPORARY:
                csdReg = 1UL << CY_SD_HOST_CSD_TEMP_WRITE_PROTECT;
                break;
            case CY_SD_HOST_DISABLE_TEMPORARY:
                csdReg = 0UL;
                break;
            default:
                ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
                break;
        }

        if (CY_SD_HOST_SUCCESS == ret)
        {
            ret = Cy_SD_Host_OpsProgramCsd(base, csdReg, context);
        }
    }
    else
    {
        ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_GetCardStatus
****************************************************************************//**
*
*  Returns the card status.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return uint32_t
*     The card status (the result of the CMD13 command).
*
*******************************************************************************/
uint32_t Cy_SD_Host_GetCardStatus(SDHC_Type *base,
                                  cy_stc_sd_host_context_t const *context)
{
    cy_stc_sd_host_cmd_config_t cmd;
    cy_en_sd_host_status_t      ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    uint32_t                    response = 0UL;
    uint32_t                    status = (1UL << CY_SD_HOST_CMD13_ERROR);

    /* Check for the NULL pointer. */
    if ((NULL != base) && (NULL != context))
    {
        cmd.commandIndex    = CY_SD_HOST_SD_CMD13;
        cmd.commandArgument = context->RCA << CY_SD_HOST_RCA_SHIFT;
        cmd.dataPresent     = false;
        cmd.enableAutoResponseErrorCheck = false;
        cmd.respType        = CY_SD_HOST_RESPONSE_LEN_48;
        cmd.enableCrcCheck  = true;
        cmd.enableIdxCheck  = true;
        cmd.cmdType         = CY_SD_HOST_CMD_NORMAL;

        ret = Cy_SD_Host_SendCommand(base, &cmd);

        if (CY_SD_HOST_SUCCESS == ret)
        {
            /* Wait for the Command Complete event. */
            ret = Cy_SD_Host_PollCmdComplete(base);
        }

        if (CY_SD_HOST_SUCCESS == ret)
        {
            (void)Cy_SD_Host_GetResponse(base, (uint32_t *)&response, false);
            status = response;
        }
        else
        {
            status = (1UL << CY_SD_HOST_CMD13_ERROR);
        }
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_GetSdStatus
****************************************************************************//**
*
*  Returns the SD status from the card.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param *sdStatus
*     The pointer to where to store the SD status array.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_GetSdStatus(SDHC_Type *base,
                                              uint32_t *sdStatus,
                                              cy_stc_sd_host_context_t const *context)
{
    cy_en_sd_host_status_t       ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    cy_stc_sd_host_cmd_config_t  cmd;
    cy_stc_sd_host_data_config_t dataConfig;

    /* Check for the NULL pointer */
    if ((NULL != base) && (NULL != sdStatus) && (NULL != context))
    {
        ret = Cy_SD_Host_OpsSendAppCmd(base, context);
        if (CY_SD_HOST_SUCCESS == ret)
        {
            cmd.commandIndex    = CY_SD_HOST_SD_CMD13;
            cmd.commandArgument = context->RCA << CY_SD_HOST_RCA_SHIFT;
            cmd.dataPresent     = true;
            cmd.enableAutoResponseErrorCheck = false;
            cmd.respType        = CY_SD_HOST_RESPONSE_LEN_48;
            cmd.enableCrcCheck  = true;
            cmd.enableIdxCheck  = true;
            cmd.cmdType         = CY_SD_HOST_CMD_NORMAL;

