RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sd_host.c
            dataConfig.blockSize            = CY_SD_HOST_SD_STATUS_BLOCKS;
            dataConfig.numberOfBlock        = 1UL;
            dataConfig.enableDma            = false;
            dataConfig.autoCommand          = CY_SD_HOST_AUTO_CMD_NONE;
            dataConfig.read                 = true;
            dataConfig.data                 = sdStatus;
            dataConfig.dataTimeout          = CY_SD_HOST_MAX_TIMEOUT;
            dataConfig.enableIntAtBlockGap  = false;
            dataConfig.enReliableWrite      = false;

            (void)Cy_SD_Host_InitDataTransfer(base, &dataConfig);

            ret = Cy_SD_Host_SendCommand(base, &cmd);

            if (CY_SD_HOST_SUCCESS == ret)
            {
                /* Wait for the Command Complete event. */
                ret = Cy_SD_Host_PollCmdComplete(base);
            }

            if (CY_SD_HOST_SUCCESS == ret)
            {
                ret = Cy_SD_Host_CmdRxData(base, &dataConfig);
            }
        }
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_GetOcr
****************************************************************************//**
*
*  Reads the Operating Condition Register (OCR) register from the card.
*
* \note This function can be used only if the card is in the Idle state.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return uint32_t
*     The OCR register.
*
* \note For combo cards, the function returns the OCR register for the IO portion only.
*
*******************************************************************************/
uint32_t Cy_SD_Host_GetOcr(SDHC_Type *base, cy_stc_sd_host_context_t const *context)
{
    uint32_t ocrReg = 0UL;

    if (CY_SD_HOST_SD == context->cardType)
    {
        (void)Cy_SD_Host_OpsSdSendOpCond(base, &ocrReg, 0UL, context);
    }
    else if (CY_SD_HOST_EMMC == context->cardType)
    {
        (void)Cy_SD_Host_MmcOpsSendOpCond(base, &ocrReg, 0UL);
    }
    else if ((CY_SD_HOST_SDIO == context->cardType) ||
             (CY_SD_HOST_COMBO == context->cardType))
    {
        (void)Cy_SD_Host_OpsSdioSendOpCond(base, &ocrReg, 0UL);
    }
    else
    {
        /* Invalid card. */
    }

    return ocrReg;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_GetCid
****************************************************************************//**
*
*  Returns the Card Identification Register (CID) contents.
*
* \note This function can be used only if the card is in the Ready state.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param cid
*     The pointer to where to store the CID register.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_GetCid(SDHC_Type *base,
                                         uint32_t *cid)
{
    cy_stc_sd_host_cmd_config_t cmd;
    cy_en_sd_host_status_t      ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    uint32_t                    i;
    uint32_t                    response[CY_SD_HOST_RESPONSE_SIZE] = { 0UL };

    /* Check for the NULL pointer */
    if ((NULL != base) && (NULL != cid))
    {
        cmd.commandIndex    = CY_SD_HOST_SD_CMD2;
        cmd.commandArgument = 0UL;
        cmd.dataPresent     = false;
        cmd.enableAutoResponseErrorCheck = false;
        cmd.respType        = CY_SD_HOST_RESPONSE_LEN_136;
        cmd.enableCrcCheck  = true;
        cmd.enableIdxCheck  = false;
        cmd.cmdType         = CY_SD_HOST_CMD_NORMAL;

        ret = Cy_SD_Host_SendCommand(base, &cmd);

        if (CY_SD_HOST_SUCCESS == ret)
        {
            /* Wait for the Command Complete event. */
            ret = Cy_SD_Host_PollCmdComplete(base);
        }

        if (CY_SD_HOST_SUCCESS == ret)
        {
            (void)Cy_SD_Host_GetResponse(base, (uint32_t *)response, true);

            /* Get CID from the response. */
            for ( i = 0UL; i < CY_SD_HOST_CID_SIZE; i++ )
            {
                cid[i] = *((uint32_t *)(response + i));
            }
        }
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_GetCsd
****************************************************************************//**
*
*  Returns the Card Specific Data (CSD) register contents.
*
* \note This function can be used only if the card is in the Stand-by state.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param *csd
*     The pointer to where to store the CSD register.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_GetCsd(SDHC_Type *base,
                                         uint32_t *csd,
                                         cy_stc_sd_host_context_t *context)
{
    cy_stc_sd_host_cmd_config_t   cmd;
    cy_en_sd_host_status_t        ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    uint32_t                      response[CY_SD_HOST_RESPONSE_SIZE] = { 0UL };
    uint32_t                      numSector;
    uint32_t                      cSize;
    uint32_t                      cSizeMult;
    uint32_t                      readBlLen;

    /* Check for the NULL pointer */
    if ((NULL != base) && (NULL != csd) && (NULL != context))
    {
        cmd.commandIndex    = CY_SD_HOST_SD_CMD9;
        cmd.commandArgument = context->RCA << CY_SD_HOST_RCA_SHIFT;
        cmd.dataPresent     = false;
        cmd.enableAutoResponseErrorCheck = false;
        cmd.respType        = CY_SD_HOST_RESPONSE_LEN_136;
        cmd.enableCrcCheck  = true;
        cmd.enableIdxCheck  = false;
        cmd.cmdType         = CY_SD_HOST_CMD_NORMAL;

        ret = Cy_SD_Host_SendCommand(base, &cmd);

        if (CY_SD_HOST_SUCCESS == ret)
        {
            /* Wait for the Command Complete event. */
            ret = Cy_SD_Host_PollCmdComplete(base);
        }

        if (ret == CY_SD_HOST_SUCCESS)
        {
            (void)Cy_SD_Host_GetResponse(base, (uint32_t *)response, true);

            (void)memcpy(csd, response, sizeof(response));
            (void)memcpy(context->csd, response, sizeof(response));

            if ((CY_SD_HOST_SDHC == context->cardCapacity) ||
                (CY_SD_HOST_SDXC == context->cardCapacity)) /* High/Ext. Capacity (CSD version 2.0) */
            {
                cSize = (response[1] & CY_SD_HOST_CSD_V2_C_SIZE_MASK) >>
                         CY_SD_HOST_CSD_V2_C_SIZE_POS;

                numSector = (cSize + 1UL) << CY_SD_HOST_CSD_V2_SECTOR_MULT;
            }
            else /* Standard Capacity (CSD version 1.0) */
            {
                cSize =  (response[2] & CY_SD_HOST_CSD_V1_C_SIZE_MSB_MASK) <<
                         CY_SD_HOST_CSD_V1_C_SIZE_MSB_MULT;    /* C_SIZE3 */
                cSize +=((response[1] & CY_SD_HOST_CSD_V1_C_SIZE_ISB_MASK) >>
                         CY_SD_HOST_CSD_V1_C_SIZE_ISB_POS) <<
                         CY_SD_HOST_CSD_V1_C_SIZE_ISB_MULT;    /* C_SIZE2 */
                cSize += (response[1] & CY_SD_HOST_CSD_V1_C_SIZE_LSB_MASK) >>
                          CY_SD_HOST_CSD_V1_C_SIZE_LSB_POS;    /* C_SIZE1 */

                cSizeMult = ((response[1] & CY_SD_HOST_CSD_V1_C_SIZE_MULT_MASK) >>
                             CY_SD_HOST_CSD_V1_C_SIZE_MULT_POS);

                readBlLen = (response[2] & CY_SD_HOST_CSD_V1_READ_BL_LEN_MASK) >>
                             CY_SD_HOST_CSD_V1_READ_BL_LEN_POS; /* READ_BL_LEN */

