RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sd_host.c
                numSector = (cSize + 1UL) << (cSizeMult + 2UL);

                if (CY_SD_HOST_CSD_V1_BL_LEN_1024 == readBlLen)
                {
                    numSector *= CY_SD_HOST_CSD_V1_1024_SECT_FACTOR;
                }
                else if (CY_SD_HOST_CSD_V1_BL_LEN_2048 == readBlLen)
                {
                    numSector *= CY_SD_HOST_CSD_V1_2048_SECT_FACTOR;
                }
                else
                {
                    /* Block length = 512 bytes (readBlLen = 9u) */
                }
            }

            context->maxSectorNum = numSector;
        }
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_GetExtCsd
****************************************************************************//**
*
*  Returns the EXTCSD Register contents. This is only for EMMC cards.
*  There are 512 bytes of data being read.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param *extCsd
*     The pointer to where to store the EXTCSD register.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_GetExtCsd(SDHC_Type *base, uint32_t *extCsd,
                                                   cy_stc_sd_host_context_t *context)
{
    cy_stc_sd_host_cmd_config_t  cmd;
    cy_en_sd_host_status_t       ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    cy_stc_sd_host_data_config_t dataConfig;

    /* Check for the NULL pointer */
    if ((NULL != base) && (NULL != extCsd) && (NULL != context))
    {
        cmd.commandIndex    = CY_SD_HOST_MMC_CMD8;
        cmd.commandArgument = context->RCA << CY_SD_HOST_RCA_SHIFT;
        cmd.dataPresent     = true;
        cmd.enableAutoResponseErrorCheck = false;
        cmd.respType        = CY_SD_HOST_RESPONSE_LEN_48;
        cmd.enableCrcCheck  = true;
        cmd.enableIdxCheck  = true;
        cmd.cmdType         = CY_SD_HOST_CMD_NORMAL;

        dataConfig.blockSize            = CY_SD_HOST_BLOCK_SIZE;
        dataConfig.numberOfBlock        = 1UL;
        dataConfig.enableDma            = false;
        dataConfig.autoCommand          = CY_SD_HOST_AUTO_CMD_NONE;
        dataConfig.read                 = true;
        dataConfig.data                 = extCsd;
        dataConfig.dataTimeout          = CY_SD_HOST_MAX_TIMEOUT;
        dataConfig.enableIntAtBlockGap  = false;
        dataConfig.enReliableWrite      = false;

        (void)Cy_SD_Host_InitDataTransfer(base, &dataConfig);

        ret = Cy_SD_Host_SendCommand(base, &cmd);

        if (CY_SD_HOST_SUCCESS == ret)
        {
            /* Wait for the Command Complete event. */
            ret = Cy_SD_Host_PollCmdComplete(base);
        }

        if (CY_SD_HOST_SUCCESS == ret)
        {
            ret = Cy_SD_Host_CmdRxData(base, &dataConfig);
        }

        if (CY_SD_HOST_SUCCESS == ret)
        {
            context->maxSectorNum = extCsd[CY_SD_HOST_EXTCSD_SEC_COUNT];

            context->cardCapacity = CY_SD_HOST_EMMC_LESS_2G;

            /* Check if the eMMC capacity is greater than 2GB */
            if ((CY_SD_HOST_MMC_LEGACY_SIZE_BYTES/CY_SD_HOST_BLOCK_SIZE) <
                 context->maxSectorNum)
            {
                context->cardCapacity = CY_SD_HOST_EMMC_GREATER_2G;
            }
        }
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_GetRca
****************************************************************************//**
*
*  Reads the Relative Card Address (RCA) register from the card.
*
* \note This function can be used only if the card is in the Identification or
* Stand-by state.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return uint32_t
*     The RCA register.
*
*******************************************************************************/
uint32_t Cy_SD_Host_GetRca(SDHC_Type *base)
{
    cy_stc_sd_host_cmd_config_t cmd;
    uint32_t                    response = 0UL;

    cmd.commandIndex    = CY_SD_HOST_SD_CMD3;
    cmd.commandArgument = 0UL;
    cmd.dataPresent     = false;
    cmd.enableAutoResponseErrorCheck = false;
    cmd.respType        = CY_SD_HOST_RESPONSE_LEN_48;
    cmd.enableCrcCheck  = true;
    cmd.enableIdxCheck  = true;
    cmd.cmdType         = CY_SD_HOST_CMD_NORMAL;

    (void)Cy_SD_Host_SendCommand(base, &cmd);

    /* Wait for the Command Complete event. */
    (void)Cy_SD_Host_PollCmdComplete(base);

    Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);

    (void)Cy_SD_Host_GetResponse(base, (uint32_t *)&response, false);

    return (response >> CY_SD_HOST_RCA_SHIFT);
}


/*******************************************************************************
* Function Name: Cy_SD_Host_GetScr
****************************************************************************//**
*
*  Returns the SD Card Configuration Register (SCR) Register contents.
*
* \note This function can be used only if the card is in the Transition state.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param *scr
*     The pointer to where to store the SCR register.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_GetScr(SDHC_Type *base,
                                         uint32_t *scr,
                                         cy_stc_sd_host_context_t const *context)
{
    cy_stc_sd_host_cmd_config_t  cmd;
    cy_en_sd_host_status_t       ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    cy_stc_sd_host_data_config_t dataConfig;

    /* Check for the NULL pointer */
    if ((NULL != base) && (NULL != scr) && (NULL != context))
    {
        ret = Cy_SD_Host_OpsSendAppCmd(base, context);
        if (CY_SD_HOST_SUCCESS == ret)
        {
            cmd.commandIndex    = CY_SD_HOST_SD_ACMD51;
            cmd.commandArgument = context->RCA << CY_SD_HOST_RCA_SHIFT;
            cmd.dataPresent     = true;
            cmd.enableAutoResponseErrorCheck = false;
            cmd.respType        = CY_SD_HOST_RESPONSE_LEN_48B;
            cmd.enableCrcCheck  = true;
            cmd.enableIdxCheck  = true;
            cmd.cmdType         = CY_SD_HOST_CMD_NORMAL;

            dataConfig.blockSize           = CY_SD_HOST_SCR_BLOCKS;
            dataConfig.numberOfBlock       = 1UL;
            dataConfig.enableDma           = false;
            dataConfig.autoCommand         = CY_SD_HOST_AUTO_CMD_NONE;
            dataConfig.read                = true;
            dataConfig.data                = (uint32_t *)scr;
            dataConfig.dataTimeout         = CY_SD_HOST_MAX_TIMEOUT;
            dataConfig.enableIntAtBlockGap = false;
            dataConfig.enReliableWrite     = false;

            (void)Cy_SD_Host_InitDataTransfer(base, &dataConfig);

            ret = Cy_SD_Host_SendCommand(base, &cmd);

            if (CY_SD_HOST_SUCCESS == ret)
            {
                /* Wait for the Command Complete event. */
                ret = Cy_SD_Host_PollCmdComplete(base);
            }

            if (CY_SD_HOST_SUCCESS == ret)
            {
                ret = Cy_SD_Host_CmdRxData(base, &dataConfig);
            }
        }
    }

    return ret;
}


