RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sd_host.c
/*******************************************************************************
* Function Name: Cy_SD_Host_ErrorReset
****************************************************************************//**
*
*  Checks for error event and resets it. Then resets the CMD line.
*
* \param *base
*     The SD host registers structure pointer.
*
*******************************************************************************/
static void Cy_SD_Host_ErrorReset(SDHC_Type *base)
{
    uint32_t intError; /* The error events mask. */

    intError = Cy_SD_Host_GetErrorInterruptStatus(base);

    /* Check the error event. */
    if (0UL < intError)
    {
        /* Clear the error event. */
        Cy_SD_Host_ClearErrorInterruptStatus(base, intError);

        Cy_SD_Host_SoftwareReset(base, CY_SD_HOST_RESET_CMD_LINE);
    }
}


/*******************************************************************************
* Function Name: Cy_SD_Host_NormalReset
****************************************************************************//**
*
*  Checks for a normal event and resets it.
*
* \param *base
*     The SD host registers structure pointer.
*
*******************************************************************************/
static void Cy_SD_Host_NormalReset(SDHC_Type *base)
{
    uint32_t intNormal; /* The normal events mask. */

    intNormal = Cy_SD_Host_GetNormalInterruptStatus(base);

    /* Check the normal event. */
    if (0UL < intNormal)
    {
        /* Clear the normal event. */
        Cy_SD_Host_ClearNormalInterruptStatus(base, intNormal);
    }
}


/*******************************************************************************
* Function Name: Cy_SD_Host_VoltageCheck
****************************************************************************//**
*
*  resets the card (CMD0) and checks the voltage (CMD8).
*
* \param *base
*     The SD host registers structure pointer.
*
* \return The CMD8 valid flag (f8).
*
*******************************************************************************/
__STATIC_INLINE bool Cy_SD_Host_VoltageCheck(SDHC_Type *base)
{
    cy_en_sd_host_status_t ret;
    bool                   f8Flag = false; /* The CMD8 valid flag. */
    uint32_t               response = 0UL;  /* The CMD response. */
    uint32_t               retry = CY_SD_HOST_VOLTAGE_CHECK_RETRY;

    while (retry > 0UL)
    {
        /* Reset Card (CMD0). */
        ret = Cy_SD_Host_OpsGoIdle(base);  /* The Idle state. */

        /* Software reset for the CMD line. */
        Cy_SD_Host_SoftwareReset(base, CY_SD_HOST_RESET_CMD_LINE);

        /* Voltage check (CMD8). */
        ret = Cy_SD_Host_OpsSendIfCond(base,
                                       CY_SD_HOST_CMD8_VHS_27_36 |
                                       CY_SD_HOST_CMD8_CHECK_PATTERN,
                                       false);

        /* Check the response. */
        (void)Cy_SD_Host_GetResponse(base,
                                     (uint32_t *)&response,
                                     false);

        /* Check the pattern. */
        if (CY_SD_HOST_CMD8_CHECK_PATTERN == (response &
                                              CY_SD_HOST_CMD8_PATTERN_MASK))
        {
            /* The pattern is valid. */
            f8Flag = true;
        }
        else if (CY_SD_HOST_VOLTAGE_CHECK_RETRY == retry)
        {
           /* CMD8 fails. Retry one more time */
        }
        else
        {
            /* The unusable card or the SDIO card. */
            ret = CY_SD_HOST_ERROR_UNUSABLE_CARD;
        }

        if ((CY_SD_HOST_ERROR_TIMEOUT == ret) || (f8Flag))
        {
            /* The pattern is valid or voltage mismatch (No response). */
            break;
        }

        retry--;
    }

    if (CY_SD_HOST_SUCCESS != ret)   /* The Idle state. */
    {
        /* Reset the error and the CMD line for the case of the SDIO card. */
        Cy_SD_Host_ErrorReset(base);
        Cy_SD_Host_NormalReset(base);
    }

    return f8Flag;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_IoOcr
****************************************************************************//**
*
*  Sends CMD5 to get IO OCR. Checks if IO is present (sdio),
*   if the memory is present (mpFlag) and if 1.8 signaling can be supported (s18aFlag).
*
* \param *base
*     The SD host registers structure pointer.
*
* \param lowVoltageSignaling
*     The lowVoltageSignaling flag.
*
* \param *s18aFlag
*     The S18A flag (1.8 signaling support).
*
* \param *sdioFlag
*     The IO flag (the number of IO functions).
*
* \param *mpFlag
*     The MEM flag (memory support).
*
* \param *ocrReg
*     The Operation Condition register (OCR).
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_IoOcr(SDHC_Type *base,
                                      bool lowVoltageSignaling,
                                      uint32_t *s18aFlag,
                                      uint32_t *sdioFlag,
                                      bool *mpFlag,
                                      uint32_t *ocrReg)
{
    cy_en_sd_host_status_t ret;
    uint32_t               retry;

    /* Get IO OCR (CMD5) */
    ret = Cy_SD_Host_OpsSdioSendOpCond(base, ocrReg, 0UL);

    /* Get the number of IO functions. */
    *sdioFlag = *ocrReg & CY_SD_HOST_CMD5_IO_NUM_MASK;

    if (0UL < *sdioFlag)
    {
        if (true == lowVoltageSignaling)
        {
            /* Set the OCR to change the signal
            * voltage to 1.8 V for the UHS-I mode.
            */
            *ocrReg = (*ocrReg & CY_SD_HOST_IO_OCR_MASK) |
                           CY_SD_HOST_ACMD41_S18R;
        }

        retry = CY_SD_HOST_RETRY_TIME;
        while (retry > 0UL)
        {
            /* Set S18R and the voltage window in IO OCR (CMD5). */
            ret = Cy_SD_Host_OpsSdioSendOpCond(base,
                                              ocrReg,
                                              *ocrReg);

            /* Check the IO power up status. */
            if (CY_SD_HOST_SUCCESS == ret)
            {
                if (CY_SD_HOST_IO_OCR_C == (*ocrReg & CY_SD_HOST_IO_OCR_C))
                {
                    /* The SDIO card supports 1.8 signaling. */
                    *s18aFlag = 1UL;
                }

