RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sd_host.c
                if(CY_SD_HOST_CMD5_MP_MASK == (*ocrReg & CY_SD_HOST_CMD5_MP_MASK))
                {
                    /* MP = 1. (The memory is supported.) */
                    *mpFlag = true;
                }

                /* IO > 0. */
                break;
            }

            Cy_SysLib_DelayUs(CY_SD_HOST_SDIO_CMD5_TIMEOUT_MS); /* 1 sec timeout. */
            retry--;
        }

        if (CY_SD_HOST_SUCCESS != ret)
        {
            /* IO = 0. */
            *sdioFlag = 0UL;
        }
    }
    else
    {
        /* Software reset for the DAT line. */
        Cy_SD_Host_SoftwareReset(base, CY_SD_HOST_RESET_DATALINE);

        /* IO = 0. We have the SD memory card. Reset errors. */
        Cy_SD_Host_ErrorReset(base);

    }

    Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_SdOcr
****************************************************************************//**
*
*  Sends ACMD41 to get SD OCR.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param lowVoltageSignaling
*     The lowVoltageSignaling flag.
*
* \param *s18aFlag
*     The S18A flag (1.8 signaling support).
*
* \param *mpFlag
*     The MEM flag (memory support).
*
* \param f8Flag
*     The CMD8 flag.
*
* \param *ocrReg
*     The Operation Condition register (OCR).
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
* If only the SD host functions which do not require context will be used, pass NULL
* as the pointer to the context.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_sd_host_status_t Cy_SD_Host_SdOcr(SDHC_Type *base,
                                      bool lowVoltageSignaling,
                                      uint32_t *s18aFlag,
                                      bool *mpFlag,
                                      bool f8Flag,
                                      uint32_t *ocrReg,
                                      cy_stc_sd_host_context_t *context)
{
    cy_en_sd_host_status_t ret;
    uint32_t               response = 0UL;  /* The CMD response. */
    uint32_t               retry;
    uint32_t               cmdArgument;

    /* Get OCR (ACMD41). The voltage window = 0. */
    ret = Cy_SD_Host_OpsSdSendOpCond(base,
                                     ocrReg,
                                     0x00000000UL,
                                     context);

    if (CY_SD_HOST_SUCCESS == ret)
    {
        /* Set the voltage window from 2.7 to 3.6 V.  */
        cmdArgument = CY_SD_HOST_ACMD41_VOLTAGE_MASK;

        if (f8Flag)
        {
            /* Set the SDHC supported bit.*/
            cmdArgument |= CY_SD_HOST_ACMD41_HCS;

            if (true == lowVoltageSignaling)
            {
                /* Set the 1.8 V request bit.*/
                cmdArgument |= CY_SD_HOST_ACMD41_S18R;
            }
        }

        /* Set OCR (ACMD41). */
        retry = CY_SD_HOST_RETRY_TIME;
        while (retry > 0UL)
        {
            ret = Cy_SD_Host_OpsSdSendOpCond(base,
                                             ocrReg,
                                             cmdArgument,
                                             context);
            if (CY_SD_HOST_SUCCESS == ret)
            {
                break;
            }
            Cy_SysLib_DelayUs(CY_SD_HOST_ACMD41_TIMEOUT_MS);
            retry--;
        }

        /* Check the response. */
        (void)Cy_SD_Host_GetResponse(base,
                                    (uint32_t *)&response,
                                    false);

        if (0UL == (response & CY_SD_HOST_OCR_CAPACITY_MASK))
        {
            /* The SDSC card. */
            context->cardCapacity = CY_SD_HOST_SDSC;
        }

        /* Check S18A. */
        if (CY_SD_HOST_OCR_S18A == (response &
                                    CY_SD_HOST_OCR_S18A))
        {
            /* The SD card supports the 1.8 signaling. */
            *s18aFlag |= 1UL;
        }

        if (CY_SD_HOST_SUCCESS == ret)
        {
            /* MP = 1. (The memory is supported.) */
            *mpFlag = true;
        }
        else
        {
            /* MP = 0. (The memory is not supported.) */
            *mpFlag = false;
        }
    }
    else if (false == f8Flag)
    {
        /* Not a SD card */
        ret = CY_SD_HOST_ERROR_UNUSABLE_CARD;
        context->cardType = CY_SD_HOST_UNUSABLE;
    }
    else
    {
        /* The card is not present or busy */
    }

    Cy_SysLib_DelayUs(CY_SD_HOST_NCC_MIN_US);

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_Enable
****************************************************************************//**
*
*  Enables the SD host block.
*
* \param *base
*     The SD host registers structure pointer.
*
*******************************************************************************/
void Cy_SD_Host_Enable(SDHC_Type *base)
{
    uint32_t retry;

    /* Check for the NULL pointer */
    if (NULL != base)
    {
        /* Enable the SDHC block. */
        SDHC_WRAP_CTL(base) = _CLR_SET_FLD32U(SDHC_WRAP_CTL(base),
                                              SDHC_WRAP_CTL_ENABLE,
                                              1UL);

        retry = CY_SD_HOST_RETRY_TIME;

        /* Enable the Internal clock. */
        SDHC_CORE_CLK_CTRL_R(base) = (uint16_t)_CLR_SET_FLD16U(SDHC_CORE_CLK_CTRL_R(base),
                                                               SDHC_CORE_CLK_CTRL_R_INTERNAL_CLK_EN,
                                                               1UL);

        while((true != _FLD2BOOL(SDHC_CORE_CLK_CTRL_R_INTERNAL_CLK_STABLE, SDHC_CORE_CLK_CTRL_R(base)))
              && (retry > 0UL))
        {
            /* Wait for the stable Internal Clock . */
            Cy_SysLib_DelayUs(CY_SD_HOST_INT_CLK_STABLE_TIMEOUT_MS);
            retry--;
        }
    }
}


