RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sd_host.c
                        /* Set the block count. */
                        SDHC_CORE_SDMASA_R(base) = dataConfig->numberOfBlock;
                    }
                    else
                    {
                        /* The data address. */
                        SDHC_CORE_SDMASA_R(base) = (uint32_t)dataConfig->data;
                    }
                }
                else
                {
                    /* The data address. */
                    SDHC_CORE_ADMA_SA_LOW_R(base) = (uint32_t)dataConfig->data;
                }
            }
            else
            {
                /* Set the block count. */
                SDHC_CORE_SDMASA_R(base) = dataConfig->numberOfBlock;
            }

            /* Set the block size. */
            SDHC_CORE_BLOCKSIZE_R(base) = _CLR_SET_FLD16U(SDHC_CORE_BLOCKSIZE_R(base),
                                          SDHC_CORE_BLOCKSIZE_R_XFER_BLOCK_SIZE,
                                          dataConfig->blockSize);

            /* Set the block count. */
            SDHC_CORE_BLOCKCOUNT_R(base) = (uint16_t)dataConfig->numberOfBlock;


            /* Set a multi- or single-block transfer.*/
            transferMode = _BOOL2FLD(SDHC_CORE_XFER_MODE_R_MULTI_BLK_SEL, (1U < dataConfig->numberOfBlock));

            /* Set the data transfer direction. */
            transferMode |= _BOOL2FLD(SDHC_CORE_XFER_MODE_R_DATA_XFER_DIR, dataConfig->read);

            /* Set the block count enable. */
            transferMode |= SDHC_CORE_XFER_MODE_R_BLOCK_COUNT_ENABLE_Msk;

            /* Enable the DMA or not. */
            transferMode |= _BOOL2FLD(SDHC_CORE_XFER_MODE_R_DMA_ENABLE, dataConfig->enableDma);

            /* Set an interrupt at the block gap. */
            SDHC_CORE_BGAP_CTRL_R(base) = (uint8_t)_CLR_SET_FLD8U(SDHC_CORE_BGAP_CTRL_R(base),
                                          SDHC_CORE_BGAP_CTRL_R_INT_AT_BGAP,
                                          ((dataConfig->enableIntAtBlockGap) ? 1UL : 0UL));

            /* Set the data timeout (Base clock*2^27). */
            SDHC_CORE_TOUT_CTRL_R(base) = _CLR_SET_FLD8U(SDHC_CORE_TOUT_CTRL_R(base),
                                                    SDHC_CORE_TOUT_CTRL_R_TOUT_CNT,
                                                    dataConfig->dataTimeout);

            /* The reliable write setting. */
            if (dataConfig->enReliableWrite)
            {
                ret = Cy_SD_Host_OpsSetBlockCount(base,
                                                  dataConfig->enReliableWrite,
                                                  dataConfig->numberOfBlock);
            }

            /* The auto-command setting. */
            switch (dataConfig->autoCommand)
            {
                case CY_SD_HOST_AUTO_CMD_NONE:
                    transferMode |= _VAL2FLD(SDHC_CORE_XFER_MODE_R_AUTO_CMD_ENABLE, 0UL);
                    break;
                case CY_SD_HOST_AUTO_CMD_12:
                    transferMode |= _VAL2FLD(SDHC_CORE_XFER_MODE_R_AUTO_CMD_ENABLE, 1UL);
                    break;
                case CY_SD_HOST_AUTO_CMD_23:
                    transferMode |= _VAL2FLD(SDHC_CORE_XFER_MODE_R_AUTO_CMD_ENABLE, 2UL);
                    break;
                case CY_SD_HOST_AUTO_CMD_AUTO:
                    transferMode |= _VAL2FLD(SDHC_CORE_XFER_MODE_R_AUTO_CMD_ENABLE, 3UL);
                    break;
                default:
                    ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
                    break;
            }

            SDHC_CORE_XFER_MODE_R(base) = (uint16_t)transferMode;
        }
    }

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_ChangeIoVoltage
****************************************************************************//**
*
*  Changes the logic level on the sd_io_volt_sel line. It assumes that
*  this line is used to control a regulator connected to the VDDIO of the PSoC.
*  This regulator allows for switching between the 3.3V and 1.8V signaling.
*
* \note The dedicated io_volt_sel pin is used to change the regulator supplying
* voltage to the VDDIO of the SD block in order to operate at 1.8V. To configure
* the custom IO pin in order to control (using the GPIO driver) the regulator
* supplying voltage, the user must implement weak Cy_SD_Host_ChangeIoVoltage().
* Also, this function must set the SIGNALING_EN bit of the SDHC_CORE_HOST_CTRL2_R
* register when ioVoltage = CY_SD_HOST_IO_VOLT_1_8V.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param ioVoltage
*     The voltage for IO.
*
*******************************************************************************/
__WEAK void Cy_SD_Host_ChangeIoVoltage(SDHC_Type *base, cy_en_sd_host_io_voltage_t ioVoltage)
{
    /* Set the 1.8V signaling enable. */
    SDHC_CORE_HOST_CTRL2_R(base) = _CLR_SET_FLD16U(SDHC_CORE_HOST_CTRL2_R(base),
                                              SDHC_CORE_HOST_CTRL2_R_SIGNALING_EN,
                                              (CY_SD_HOST_IO_VOLT_1_8V == ioVoltage) ? 1UL : 0UL);
}


/*******************************************************************************
* Function Name: Cy_SD_Host_IsCardConnected
****************************************************************************//**
*
*  Checks to see if a card is currently connected.
*
* \note You can use any GPIO custom pin for Card Detect. Add the SD Host driver
* Cy_SD_Host_IsCardConnected() function with the __WEAK type to your code.
* This function could read the value from any GPIO pin and return true when
* the card is connected.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return bool
*     true - the card is connected, false - the card is removed (not connected).
*
*******************************************************************************/
__WEAK bool Cy_SD_Host_IsCardConnected(SDHC_Type const *base)
{
    while(true != _FLD2BOOL(SDHC_CORE_PSTATE_REG_CARD_STABLE, SDHC_CORE_PSTATE_REG(base)))
    {
        /* Wait until the card is stable. */
    }

    return _FLD2BOOL(SDHC_CORE_PSTATE_REG_CARD_INSERTED, SDHC_CORE_PSTATE_REG(base));
}


