RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sd_host.c
/*******************************************************************************
* Function Name: Cy_SD_Host_SoftwareReset
****************************************************************************//**
*
*  Issues the software reset command to the SD card.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param reset
*     The reset type.
*
*******************************************************************************/
void Cy_SD_Host_SoftwareReset(SDHC_Type *base,
                              cy_en_sd_host_reset_t reset)
{
    switch (reset)
    {
        case CY_SD_HOST_RESET_DATALINE:
            SDHC_CORE_SW_RST_R(base) = (uint8_t)_VAL2FLD(SDHC_CORE_SW_RST_R_SW_RST_DAT, 1UL);

            /* Wait for at least 3 card clock periods */
            Cy_SysLib_DelayUs(CY_SD_HOST_3_PERIODS_US);

            while(false != _FLD2BOOL(SDHC_CORE_SW_RST_R_SW_RST_DAT, SDHC_CORE_SW_RST_R(base)))
            {
                /* Wait until the reset completes. */
            }

            break;
        case CY_SD_HOST_RESET_CMD_LINE:
            SDHC_CORE_SW_RST_R(base) = (uint8_t)_VAL2FLD(SDHC_CORE_SW_RST_R_SW_RST_CMD, 1UL);

            /* Wait for at least 3 card clock periods */
            Cy_SysLib_DelayUs(CY_SD_HOST_3_PERIODS_US);

            while(false != _FLD2BOOL(SDHC_CORE_SW_RST_R_SW_RST_CMD, SDHC_CORE_SW_RST_R(base)))
            {
                /* Wait until the reset completes. */
            }

            break;
        case CY_SD_HOST_RESET_ALL:

            SDHC_CORE_CLK_CTRL_R(base) = 0U;

            /* Wait for at least 3 card clock periods */
            Cy_SysLib_DelayUs(CY_SD_HOST_3_PERIODS_US);

            SDHC_CORE_SW_RST_R(base) = (uint8_t)_VAL2FLD(SDHC_CORE_SW_RST_R_SW_RST_ALL, 1UL);

            while(false != _FLD2BOOL(SDHC_CORE_SW_RST_R_SW_RST_ALL, SDHC_CORE_SW_RST_R(base)))
            {
                /* Wait until the reset completes. */
            }

            /* Enable the Internal clock. */
            SDHC_CORE_CLK_CTRL_R(base) = (uint16_t)_CLR_SET_FLD16U(SDHC_CORE_CLK_CTRL_R(base),
                                            SDHC_CORE_CLK_CTRL_R_INTERNAL_CLK_EN,
                                            1UL);

            while(true != _FLD2BOOL(SDHC_CORE_CLK_CTRL_R_INTERNAL_CLK_STABLE, SDHC_CORE_CLK_CTRL_R(base)))
            {
                /* Wait for the stable Internal Clock. */
            }

            break;
        default:
            /* Unknown Reset selection*/
            break;
    }
}


/*******************************************************************************
* Function Name: Cy_SD_Host_GetPresentState
****************************************************************************//**
*
*  Returns the values of the present state register.
*
* \param *base
*     The SD host registers structure pointer.
*
* \return The value of the present state register.
*
*******************************************************************************/
uint32_t Cy_SD_Host_GetPresentState(SDHC_Type const *base)
{
    uint32_t ret;

    ret = SDHC_CORE_PSTATE_REG(base);

    return ret;
}


/*******************************************************************************
* Function Name: Cy_SD_Host_DeepSleepCallback
****************************************************************************//**
*
* This function handles the transition of the SD Host into and out of
* Deep Sleep mode. It disables SD CLK before going to Deep Sleep mode and
* enables SD CLK after wake up from Deep Sleep mode.
* If the DAT line is active, or a read (write) transfer is being executed on
* the bus, the device cannot enter Deep Sleep mode.
*
* This function must be called during execution of \ref Cy_SysPm_CpuEnterDeepSleep.
* To do it, register this function as a callback before calling
* \ref Cy_SysPm_CpuEnterDeepSleep : specify \ref CY_SYSPM_DEEPSLEEP as the callback
* type and call \ref Cy_SysPm_RegisterCallback.
*
* \note When waking up from Deep Sleep, the SD Host driver requires up to 1 us
* for clock stabilization. By default the SD Host driver will wait this length
* of time on power up. The waiting loop is implemented in this function.
* If the application is time sensitive this delay can be overridden by the
* application by defining \ref CY_SD_HOST_CLK_RAMP_UP_TIME_US_WAKEUP.
* This allows the application to perform other operations while the clock
* is stabilizing in the background. However, the application must still make sure
* that the SD Host clock has had time to stabilize before attempting to use the
* SD card. The recommended way to override the value is to specify this as
* a custom define on the compiler command line. This can be done by appending
* the entry to the DEFINES variable in the application Makefile.
* Eg: DEFINES+=CY_SD_HOST_CLK_RAMP_UP_TIME_US_WAKEUP=40.
*
* \param callbackParams
* The pointer to the callback parameters structure
* \ref cy_stc_syspm_callback_params_t.
*
* \param mode
* Callback mode, see \ref cy_en_syspm_callback_mode_t
*
* \return
* \ref cy_en_syspm_status_t
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SD_Host_DeepSleepCallback(cy_stc_syspm_callback_params_t *callbackParams,
                                                  cy_en_syspm_callback_mode_t mode)
{
    cy_en_syspm_status_t ret = CY_SYSPM_FAIL;
    SDHC_Type *locBase = (SDHC_Type *) (callbackParams->base);

    switch(mode)
    {
        case CY_SYSPM_CHECK_READY:
        {
            /* Check DAT Line Active */
            uint32_t pState = Cy_SD_Host_GetPresentState(locBase);
            if ((CY_SD_HOST_DAT_LINE_ACTIVE != (pState & CY_SD_HOST_DAT_LINE_ACTIVE)) &&
                (CY_SD_HOST_CMD_CMD_INHIBIT_DAT != (pState & CY_SD_HOST_CMD_CMD_INHIBIT_DAT)))
            {
                ret = CY_SYSPM_SUCCESS;
            }
        }
        break;

        case CY_SYSPM_CHECK_FAIL:
        {
            ret = CY_SYSPM_SUCCESS;
        }
        break;

        case CY_SYSPM_BEFORE_TRANSITION:
        {
            /* Disable SD CLK before going to Deep Sleep mode */
            Cy_SD_Host_DisableSdClk(locBase);

            ret = CY_SYSPM_SUCCESS;
        }
        break;

        case CY_SYSPM_AFTER_TRANSITION:
        {
            /* Enable SD CLK after wake up from Deep Sleep mode */
            Cy_SD_Host_EnableSdClk(locBase);

            /* Wait for the stable CLK */
            Cy_SysLib_DelayUs(CY_SD_HOST_CLK_RAMP_UP_TIME_US_WAKEUP);

            ret = CY_SYSPM_SUCCESS;
        }
        break;

        default:
            /* Unknown state */
            break;
    }

