RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_sd_host.c
    return (ret);
}

/*******************************************************************************
* Function Name: Cy_SD_Host_GetBlockCount
****************************************************************************//**
*
*  Returns the Block count in SD/eMMC Card.
*
* \param *base
*     The SD host registers structure pointer.
*
* \param *block_count
*     The pointer to store the block_count.
*
* \param context
* The pointer to the context structure \ref cy_stc_sd_host_context_t allocated
* by the user. The structure is used during the SD host operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return \ref cy_en_sd_host_status_t
*
*******************************************************************************/
cy_en_sd_host_status_t Cy_SD_Host_GetBlockCount(SDHC_Type *base,
                                         uint32_t *block_count,
                                         cy_stc_sd_host_context_t *context)
{
    cy_en_sd_host_status_t ret = CY_SD_HOST_SUCCESS;

    /* Check for the NULL pointer */
    if ((NULL != base) && (NULL != block_count) && (NULL != context))
    {
        if ((CY_SD_HOST_SD == context->cardType) || (CY_SD_HOST_EMMC == context->cardType))
        {
            *block_count = context->maxSectorNum;
        }
    }
    else
    {
        ret = CY_SD_HOST_ERROR_INVALID_PARAMETER;
    }

    return ret;
}


CY_MISRA_BLOCK_END('MISRA C-2012 Rule 18.1');

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXSDHC */

/* [] END OF FILE */
